docs/1c-export-mobile/MobileAgent/Documents/ВозвратОтПокупателя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<Document>
		<Properties>
			<Name>ВозвратОтПокупателя</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Продажи</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиТоваров</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаПартнера</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПартнера</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Штрихкод</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

docs/1c-export-mobile/MobileAgent/InformationRegisters/ЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатуры</Name>
			<Comment>(Упр)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦенаАкция</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонецАкции</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипЦен</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

docs/1c-export-mobile/MobileAgent/InformationRegisters/Штрихкоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<InformationRegister>
		<Properties>
			<Name>Штрихкоды</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Владелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

docs/1c-export-mobile/MobileAgent/Documents/ВозвратОтПокупателя/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПересчитатьЦеныВСтроке(ТекНомерСтроки = -1)
	Если ТекНомерСтроки >=0 Тогда 	
		ТекСтрока = Объект.Товары.НайтиПоИдентификатору(ТекНомерСтроки);
	Иначе 
		Если Элементы.Товары.ТекущаяСтрока <> Неопределено Тогда 
			ТекСтрока = Объект.Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
		КонецЕсли;
	КонецЕсли;

	з = Новый Запрос;
	з.Текст = "ВЫБРАТЬ
	          |	ЦеныНоменклатуры.Цена,
	          |	ЦеныНоменклатуры.ЕдиницаИзмерения,
	          |	ЦеныНоменклатуры.ТипЦен
	          |ИЗ
	          |	РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
	          |		ПОЛНОЕ СОЕДИНЕНИЕ РегистрСведений.Штрихкоды КАК Штрихкоды
	          |		ПО ЦеныНоменклатуры.Номенклатура = Штрихкоды.Владелец
	          |			И ЦеныНоменклатуры.ХарактеристикаНоменклатуры = Штрихкоды.ХарактеристикаНоменклатуры
	          |			И ЦеныНоменклатуры.ЕдиницаИзмерения = Штрихкоды.ЕдиницаИзмерения
	          |ГДЕ
	          |	ЦеныНоменклатуры.Номенклатура = &Номенклатура
	          |	И ЦеныНоменклатуры.ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры";	
	з.УстановитьПараметр("Номенклатура",ТекСтрока.Номенклатура);
	з.УстановитьПараметр("ХарактеристикаНоменклатуры", ТекСтрока.ХарактеристикаНоменклатуры);
	Выборка = з.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.ТипЦен.ЭтоЦенаПартнера Тогда 
			ТекСтрока.ЦенаПартнера = Выборка.Цена;
			ТекСтрока.СуммаПартнера = Выборка.Цена * ТекСтрока.Количество;
		Иначе 
			Если ТекСтрока.Цена = 0 Тогда 
				ТекСтрока.Цена = Выборка.Цена;
			КонецЕсли;
			ТекСтрока.Сумма = Выборка.Цена * ТекСтрока.Количество;
		КонецЕсли;
		ТекСтрока.ЕдиницаИзмерения = Выборка.ЕдиницаИзмерения;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	Если Элементы.Товары.ТекущиеДанные.Количество = 0 Тогда 
		Элементы.Товары.ТекущиеДанные.Количество = 1;
	КонецЕсли;	
	ПересчитатьЦеныВСтроке();
КонецПроцедуры


&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	Элементы.Товары.ТекущиеДанные.Сумма = Элементы.Товары.ТекущиеДанные.Количество * Элементы.Товары.ТекущиеДанные.Цена;
	Элементы.Товары.ТекущиеДанные.СуммаПартнера = Элементы.Товары.ТекущиеДанные.Количество * Элементы.Товары.ТекущиеДанные.ЦенаПартнера;
КонецПроцедуры









&НаКлиенте
Процедура ИзменитьТовары(Команда)
		ФормаДобавления = ПолучитьФорму("ОбщаяФорма.ФормаПодбораНоменклатурыДляВозврата",,ЭтаФорма);
		//Для Каждого Строка Из Объект.Товары Цикл
		//	НовСтрока = ФормаДобавления.ТаблицаВыбора.Добавить();
		//	ЗаполнитьЗначенияСвойств(НовСтрока,Строка);
		//КонецЦикла;

	ФормаДобавления.Открыть();
	
  		
КонецПроцедуры


&НаКлиенте
Процедура УдалитьСтроку(Команда)
	Если Объект.Товары.Количество() Тогда 
		Объект.Товары.Удалить(Объект.Товары.Индекс(Элементы.Товары.ТекущиеДанные));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗакрыть(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура СканироватьШК(Команда)
	
	#Если МобильноеПриложениеКлиент Тогда
	
	ОбработчикСканирования = Новый ОписаниеОповещения("ОбработкаСканирования", ЭтаФорма);	
	СредстваМультимедиа.ПоказатьСканированиеШтрихКодов("Сканируйте штрихкоды",ОбработчикСканирования);

	#КонецЕсли


КонецПроцедуры

&НаКлиенте
Процедура ОбработкаСканирования(Штрихкод, Результат, Сообщение, ДополнительныеПараметры) Экспорт
	СтруктураТовара = Общий.ПолучитьДанныеТовараПоШК(Строка(Штрихкод));
	Если СтруктураТовара = "" Тогда 
		Сообщить("Не найден товар "+Штрихкод);
		Возврат;
	КонецЕсли;
	ДобавитьТовар(СтруктураТовара.Номенклатура,СтруктураТовара.Характеристика,СтруктураТовара.ЕдиницаИзмерения,1,Штрихкод);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
			НовСтрока = Объект.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтрока,ВыбранноеЗначение);	
			ПересчитатьЦеныВСтроке(НовСтрока.ПолучитьИдентификатор());
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьТовар(Номенклатура,ХарактеристикаНоменклатуры,ЕдиницаИзмерения,Количество,Штрихкод)
	СтрокиТовара = Объект.Товары.НайтиСтроки(Новый Структура("Номенклатура,ХарактеристикаНоменклатуры,ЕдиницаИзмерения",Номенклатура,ХарактеристикаНоменклатуры,ЕдиницаИзмерения));
	НовСтр = Неопределено;
	Если СтрокиТовара.Количество() Тогда 
		НовСтр = СтрокиТовара[0];
		НовСтр.Количество = НовСтр.Количество + Количество;
	Иначе
	НовСтр = Объект.Товары.Добавить();
	НовСтр.Номенклатура = Номенклатура;
	НовСтр.ХарактеристикаНоменклатуры = ХарактеристикаНоменклатуры;
	НовСтр.ЕдиницаИзмерения = ЕдиницаИзмерения;
	НовСтр.Количество = Количество;
	НовСтр.Штрихкод = Штрихкод;

	КонецЕсли;
	ПересчитатьЦеныВСтроке(НовСтр.ПолучитьИдентификатор());
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Элементы.ГруппаДоступа.Доступность = Ложь;
		Элементы.Товары.ТолькоПросмотр = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьШКБыстро(Команда)
	ДобавитьШКБыстроКод = Формат(ДобавитьШКБыстро,"ЧДЦ=; ЧГ=0");
	СтруктураТовара = Общий.ПолучитьДанныеТовараПоШК(Строка(ДобавитьШКБыстроКод));
	Если СтруктураТовара = "" Тогда 
		Сообщить("Не найден товар "+ДобавитьШКБыстроКод);
		Возврат;
	КонецЕсли;
	ДобавитьТовар(СтруктураТовара.Номенклатура,СтруктураТовара.Характеристика,СтруктураТовара.ЕдиницаИзмерения,1,ДобавитьШКБыстроКод);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ=Истина;

КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	Элементы.Товары.ТекущиеДанные.Сумма = Элементы.Товары.ТекущиеДанные.Количество * Элементы.Товары.ТекущиеДанные.Цена;
КонецПроцедуры
